---
kind: property
id: P:Autodesk.Revit.DB.IFC.ImporterIFC.FullFileName
source: html/ad440967-6daf-bb3e-6066-9ceccee0bab3.htm
---
# Autodesk.Revit.DB.IFC.ImporterIFC.FullFileName Property

The full file name of the IFC file to be import.

## Syntax (C#)
```csharp
public string FullFileName { get; }
```